tiborsimon/embedded-tdd-headers/pic/8bit/pic18f2420_tdd.h
#define TO                            522
#define nRI                           523
#define NOT_RI                        524
#define RI                            525
#define SBOREN                        526
#define IPEN                          527
#define WDTCON                        528
#define SWDTE                         529
#define SWDTEN                        530
#define HLVDCON                       531
#define HLVDL                         532
#define HLVDL0                        533
#define LVV0                          534
#define LVDL0                         535
#define HLVDL1                        536
#define LVDL1                         537
#define LVV1                          538
#define HLVDL2                        539
#define LVV2                          540
#define LVDL2                         541
#define HLVDL3                        542
#define LVV3                          543
#define LVDL3                         544
#define HLVDEN                        545
#define LVDEN                         546
#define BGST                          547
#define IRVST                         548
#define IVRST                         549
#define VDIRMAG                       550
#define OSCCON                        551
#define SCS0                          552
#define SCS                           553
#define SCS1                          554
#define FLTS                          555
#define IOFS                          556
#define OSTS                          557
#define IRCF                          558
#define IRCF0                         559
#define IRCF1                         560
#define IRCF2                         561
#define IDLEN                         562
#define T0CON                         563
#define T0PS                          564
#define T0PS0                         565
#define T0PS1                         566
#define T0PS2                         567
#define PSA                           568
#define T0PS3                         569
#define T0SE                          570
#define T0CS                          571
#define T08BIT                        572
#define T016BIT                       573
#define TMR0ON                        574
#define STATUS                        575
#define C                             576
#define CARRY                         577
#define DC                            578
#define ZERO                          579
#define Z                             580
#define OV                            581
#define OVERFLOW                      582
#define N                             583
#define NEGATIVE                      584
#define INTCON3                       585
#define INT1IF                        586
#define INT1F                         587
#define INT2IF                        588
#define INT2F                         589
#define INT1E                         590
#define INT1IE                        591
#define INT2IE                        592
#define INT2E                         593
#define INT1P                         594
#define INT1IP                        595
#define INT2IP                        596
#define INT2P                         597
#define INTCON2                       598
#define RBIP                          599
#define TMR0IP                        600
#define INTEDG2                       601
#define INTEDG1                       602
#define INTEDG0                       603
#define RBPU                          604
#define NOT_RBPU                      605
#define nRBPU                         606
#define INTCON                        607
#define RBIF                          608
#define INT0F                         609
#define INT0IF                        610
#define T0IF                          611
#define TMR0IF                        612
#define RBIE                          613
#define INT0E                         614
#define INT0IE                        615
#define T0IE                          616
#define TMR0IE                        617
#define PEIE                          618
#define PEIE_GIEL                     619
#define GIEL                          620
#define GIE_GIEH                      621
#define GIE                           622
#define GIEH                          623
#define SP0                           624
#define STKPTR                        625
#define SP1                           626
#define SP2                           627
#define SP3                           628
#define SP4                           629
#define STKUNF                        630
#define STKOVF                        631
#define STKFUL                        632

#endif // _PIC18F2420_H_
